"""
Решение квадратного уравнения
"""

#подлючаем модуль для извлечения квадратного корня 
import math

a = int(input("введите a: "))
b = int(input("введите b: "))
c = int(input("введите c: "))
if a == 0:
    print("это не квадратное уравнение")
else:
    D = b**2 - 4 * a * c
    if D > 0:
        x1 = (-b + math.sqrt(D)) / (2 * a)
        x2 = (-b - math.sqrt(D)) / (2 * a)
        print(f"два корня:x1={x1:.2f},x2={x2:.2f}")
    elif D == 0:
        x = -b / (2 * a)
        print(f"одинкорень:x={x:.2f}")
    else:
        print("нет действительных корней")
