"""
Определение типа треугольника
"""

a = int(input("введите сторону a: "))
b = int(input("введите сторону b: "))
c = int(input("введите сторону c: "))
# проверка условия существования треугольника
if a + b > c and a + c > b and b + c > a:
    # условия для определения типа
    if a == b == c:
        print("равносторонний треугольник")
    elif a == b or a == c or b == c:
        print("равнобедренный треугольник")
    else:
        print("разносторонний треугольник")
else:
    print("треугольник не существует ")
