"""
Перевести число из десятичной системы в двоичную, восьмеричную,
шестнадцатеричную с проверкой корректности ввода.
"""

try:
    # Запрашиваем ввод и сразу преобразуем в целое число
    number = int(input("введите целое десятичное число: "))
    if number < 0:
        print("введите положительное число")
    else:
        print(f"Двоичная: {bin(number)[2:]}")
        print(f"Восьмеричная: {oct(number)[2:]}")
        print(f"Шестнадцатеричная: {hex(number)[2:].upper()}")
except ValueError:
    # Если ввести не число, сработает этот блок
    print("Ошибка: нужно ввести целое число")
