"""
По координатам точки (x, y) определить, в какой четверти она находится,
 или на оси.
"""

x=float(input("введите координату х: "))
y=float(input("введите координату y: "))
# Используем логические операторы and для проверки обоих условий
if x>0 and y>0:
    print('точка находится в 1 четверти')
elif x<0 and y>0:
    print('точка находится вo 2 четверти')
elif x<0 and y<0:
    print('точка находится в 3 четверти')
elif x>0 and y<0:
    print('точка находится в 4 четверти')
# Обработка краевых случаев (точка на осях)
elif x==0 and y==0:
    print('точка находится в начале координат')
elif x==0:
    print(' точка лежит на оси Y')
else:
    print(' точка лежит на оси Х')


